# 데이터프레임을 파이썬 코드로 생성하기

In [1]:
import pandas as pd

## 딕셔너리로 데이터프레임 생성하기
파이썬의 기본 자료구조로 데이터프레임 생성이 가능합니다.  
아래의 예제는 딕셔너리로 데이터프레임을 생성하는 예제입니다.

In [6]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

In [7]:
df = pd.DataFrame(friend_dict_list)

In [8]:
df.head() # 컬럼의 순서를 보장하지 않음

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

데이터프레임 생성 시, 컬럼의 순서가 뒤바뀔 수 있습니다.  
아래와 같이 컬럼을 원하시는 순서로 지정하실 수 있습니다.

In [9]:
df = df[['name', 'age', 'job']]

In [10]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## OrderedDict로 데이터프레임 생성하기
OrderedDict 자료구조로 데이터프레임을 생성하면, 컬럼의 순서가 뒤바뀌지 않습니다.

In [11]:
from collections import OrderedDict # OrderedDict 컬럼의 순서를 보장

In [12]:
friend_ordered_dict = OrderedDict(
    [ 
        ('name', ['John', 'Jenny', 'Nate']),
        ('age', [20, 30, 30]),
        ('job', ['student', 'developer', 'teacher']) 
    ] 
)

In [13]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [14]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## list로 데이터프레임 생성하기
리스트로 데이터프레임을 생성하는 예제입니다.

In [19]:
friend_list = [ 
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher'] 
]

In [20]:
column_name = ['name', 'age', 'job']

In [21]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [22]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

한번에 넣을려고 할 때

In [23]:
friend_list = [ 
    ['name',['John', 'Jenny', 'Nate']],
    ['age',[20,30,30]],
    ['job',['student', 'developer', 'teacher']] 
]

In [25]:
# df = pd.DataFrame.from_items(friend_list)
df = pd.DataFrame.from_dict( dict(friend_list) )  # 수정됨

In [27]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher